src/Documents/ПеремещениеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПеремещениеДенежныхСредств</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваНаЛицевыхСчетах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникВидЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСписанияСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриемникВидЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриемникЗачисленияСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Enums/ТипыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Comment>Денежные средства на лицевом счете</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежнаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аванс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводыВПути</Name>
					<Comment>Для фин. операций передачи денег из организации в банк</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БонусныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемаБыстрыхПлатежей</Name>
					<Comment>Для СБП и ссылок на оплату</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ПеремещениеДенежныхСредств/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Формирует таблицу данных документа.
//
// Параметры:
//	ДокументСсылка - ДокументСсылка.ПриходДенежныхСредствПлан - Текущий документ
//	СтруктураДополнительныеСвойства - ДополнительныеСвойства - Дополнительные свойства документа
//	
Процедура УстановитьНачальныеДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
    Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	1 КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ПеремещениеДенежныхСредств.Дата КАК Период,
	|	ПеремещениеДенежныхСредств.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПеремещениеДенежныхСредств.ТипДенежныхСредств КАК ТипДенежныхСредств,
	|	ПеремещениеДенежныхСредств.ИсточникСписанияСредств КАК ИсточникДенежныхСредств,
	|	ПеремещениеДенежныхСредств.СуммаДокумента КАК Сумма,
	|	ПеремещениеДенежныхСредств.СтатьяРасходов КАК СтатьяРасходов
	|ПОМЕСТИТЬ ВременнаяТаблицаДенежныеСредства
	|ИЗ
	|	Документ.ПеремещениеДенежныхСредств КАК ПеремещениеДенежныхСредств
	|ГДЕ
	|	ПеремещениеДенежныхСредств.Ссылка = &Ссылка
	|	И НЕ ПеремещениеДенежныхСредств.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхсредств.ЛицевойСчет)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ПеремещениеДенежныхСредств.Дата,
	|	ПеремещениеДенежныхСредств.СтруктурнаяЕдиница,
	|	ПеремещениеДенежныхСредств.ТипДенежныхСредств,
	|	ПеремещениеДенежныхСредств.ПриемникЗачисленияСредств,
	|	ПеремещениеДенежныхСредств.СуммаДокумента,
	|	ПеремещениеДенежныхСредств.СтатьяРасходов
	|ИЗ
	|	Документ.ПеремещениеДенежныхСредств КАК ПеремещениеДенежныхСредств
	|ГДЕ
	|	ПеремещениеДенежныхСредств.Ссылка = &Ссылка
	|	И НЕ ПеремещениеДенежныхСредств.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхсредств.ЛицевойСчет)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	1 КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ПеремещениеДенежныхСредств.Дата КАК Период,
	|	ПеремещениеДенежныхСредств.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПеремещениеДенежныхСредств.ИсточникВидЛицевогоСчета КАК ВидСчета,
	|	ПеремещениеДенежныхСредств.ИсточникСписанияСредств КАК Контрагент,
	|	ПеремещениеДенежныхСредств.СуммаДокумента КАК Сумма
	|ПОМЕСТИТЬ ВременнаяТаблицаДенежныеСредстваНаЛицевыхСчетах
	|ИЗ
	|	Документ.ПеремещениеДенежныхСредств КАК ПеремещениеДенежныхСредств
	|ГДЕ
	|	ПеремещениеДенежныхСредств.Ссылка = &Ссылка
	|	И ПеремещениеДенежныхСредств.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхсредств.ЛицевойСчет)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ПеремещениеДенежныхСредств.Дата,
	|	ПеремещениеДенежныхСредств.СтруктурнаяЕдиница,
	|	ПеремещениеДенежныхСредств.ПриемникВидЛицевогоСчета,
	|	ПеремещениеДенежныхСредств.ПриемникЗачисленияСредств,
	|	ПеремещениеДенежныхСредств.СуммаДокумента
	|ИЗ
	|	Документ.ПеремещениеДенежныхСредств КАК ПеремещениеДенежныхСредств
	|ГДЕ
	|	ПеремещениеДенежныхСредств.Ссылка = &Ссылка
	|	И ПеремещениеДенежныхСредств.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхсредств.ЛицевойСчет)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	1 КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ПеремещениеДенежныхСредств.Дата КАК Период,
	|	ПеремещениеДенежныхСредств.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ПеремещениеДенежныхСредств.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяССылка)
	|			ТОГДА ПеремещениеДенежныхСредств.СтруктурнаяЕдиница.Организация
	|		ИНАЧЕ ПеремещениеДенежныхСредств.Организация
	|	КОНЕЦ КАК Организация,
	|	ПеремещениеДенежныхСредств.ИсточникСписанияСредств КАК Контрагент,
	|	ПеремещениеДенежныхСредств.СуммаДокумента КАК Сумма
	|ПОМЕСТИТЬ ВременнаяТаблицаВзаиморасчетыКонтрагентов
	|ИЗ
	|	Документ.ПеремещениеДенежныхСредств КАК ПеремещениеДенежныхСредств
	|ГДЕ
	|	ПеремещениеДенежныхСредств.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ЛицевойСчет)
	|	И ПеремещениеДенежныхСредств.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ПеремещениеДенежныхСредств.Дата,
	|	ПеремещениеДенежныхСредств.СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ПеремещениеДенежныхСредств.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяССылка)
	|			ТОГДА ПеремещениеДенежныхСредств.СтруктурнаяЕдиница.Организация
	|		ИНАЧЕ ПеремещениеДенежныхСредств.Организация
	|	КОНЕЦ,
	|	ПеремещениеДенежныхСредств.ПриемникЗачисленияСредств,
	|	ПеремещениеДенежныхСредств.СуммаДокумента
	|ИЗ
	|	Документ.ПеремещениеДенежныхСредств КАК ПеремещениеДенежныхСредств
	|ГДЕ
	|	ПеремещениеДенежныхСредств.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ЛицевойСчет)
	|	И ПеремещениеДенежныхСредств.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПеремещениеДенежныхСредств.Дата КАК Период,
	|	ПеремещениеДенежныхСредств.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Касса) КАК СчетДт,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Касса) КАК СчетКт,
	|	ПеремещениеДенежныхСредств.ПриемникЗачисленияСредств КАК СубконтоДт1,
	|	ВЫБОР
	|		КОГДА ПеремещениеДенежныхСредств.СтатьяРасходов <> ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка)
	|			ТОГДА ПеремещениеДенежныхСредств.СтатьяРасходов
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПеремещениемеждуКассами)
	|	КОНЕЦ КАК СубконтоДт2,
	|	ПеремещениеДенежныхСредств.ИсточникСписанияСредств КАК СубконтоКт1,
	|	ВЫБОР
	|		КОГДА ПеремещениеДенежныхСредств.СтатьяРасходов <> ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка)
	|			ТОГДА ПеремещениеДенежныхСредств.СтатьяРасходов
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПеремещениемеждуКассами)
	|	КОНЕЦ КАК СубконтоКт2,
	|	ПеремещениеДенежныхСредств.СуммаДокумента КАК Сумма,
	|	""Перемещение денежных средств"" КАК Содержание
	|ПОМЕСТИТЬ ВременнаяТаблицаУправленческий
	|ИЗ
	|	Документ.ПеремещениеДенежныхСредств КАК ПеремещениеДенежныхСредств
	|ГДЕ
	|	ПеремещениеДенежныхСредств.Ссылка = &Ссылка
	|	И ПеремещениеДенежныхСредств.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПеремещениеДенежныхСредств.Дата,
	|	ПеремещениеДенежныхСредств.СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Банк),
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Банк),
	|	ПеремещениеДенежныхСредств.ПриемникЗачисленияСредств,
	|	ВЫБОР
	|		КОГДА ПеремещениеДенежныхСредств.СтатьяРасходов <> ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка)
	|			ТОГДА ПеремещениеДенежныхСредств.СтатьяРасходов
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПеремещениемеждуСчетами)
	|	КОНЕЦ,
	|	ПеремещениеДенежныхСредств.ИсточникСписанияСредств,
	|	ВЫБОР
	|		КОГДА ПеремещениеДенежныхСредств.СтатьяРасходов <> ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка)
	|			ТОГДА ПеремещениеДенежныхСредств.СтатьяРасходов
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПеремещениемеждуСчетами)
	|	КОНЕЦ,
	|	ПеремещениеДенежныхСредств.СуммаДокумента,
	|	""Перемещение денежных средств""
	|ИЗ
	|	Документ.ПеремещениеДенежныхСредств КАК ПеремещениеДенежныхСредств
	|ГДЕ
	|	ПеремещениеДенежныхСредств.Ссылка = &Ссылка
	|	И ПеремещениеДенежныхСредств.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПеремещениеДенежныхСредств.Дата,
	|	ПеремещениеДенежныхСредств.СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПокупателиПоАвансам),
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПокупателиПоАвансам),
	|	ПеремещениеДенежныхСредств.ПриемникЗачисленияСредств,
	|	ПеремещениеДенежныхСредств.ПриемникВидЛицевогоСчета,
	|	ПеремещениеДенежныхСредств.ИсточникСписанияСредств,
	|	ПеремещениеДенежныхСредств.ИсточникВидЛицевогоСчета,
	|	ПеремещениеДенежныхСредств.СуммаДокумента,
	|	""Перемещение денежных средств""
	|ИЗ
	|	Документ.ПеремещениеДенежныхСредств КАК ПеремещениеДенежныхСредств
	|ГДЕ
	|	ПеремещениеДенежныхСредств.Ссылка = &Ссылка
	|	И ПеремещениеДенежныхСредств.ТипДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ЛицевойСчет)";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);	
	Запрос.ВыполнитьПакет();
	
	СформироватьТаблицаДенежныеСредства(СтруктураДополнительныеСвойства);
	СформироватьТаблицаДенежныеСредстваНаЛицевыхСчетах(СтруктураДополнительныеСвойства);
	СформироватьТаблицаВзаиморасчетыСКонтрагентами(СтруктураДополнительныеСвойства);
	СформироватьТаблицаУправленческий(СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДенежныеСредства(СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.ВидДвижения КАК ВидДвижения,
	|	ТаблицаДокумента.Период КАК Период,
	|	ТаблицаДокумента.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаДокумента.ТипДенежныхСредств КАК ТипДенежныхСредств,
	|	ТаблицаДокумента.ИсточникДенежныхСредств КАК БанковскийСчетКасса,
	|	ТаблицаДокумента.Сумма КАК Сумма,
	|	ТаблицаДокумента.СтатьяРасходов КАК Статья
	|ИЗ
	|	ВременнаяТаблицаДенежныеСредства КАК ТаблицаДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДенежныеСредства", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаДенежныеСредства()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДенежныеСредстваНаЛицевыхСчетах(СтруктураДополнительныеСвойства)
	
    Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДенежныеСредстваНаЛицевыхСчетах.НомерСтроки,
	|	ДенежныеСредстваНаЛицевыхСчетах.Период,
	|	ДенежныеСредстваНаЛицевыхСчетах.СтруктурнаяЕдиница,
	|	ДенежныеСредстваНаЛицевыхСчетах.Контрагент,
	|	ДенежныеСредстваНаЛицевыхСчетах.ВидДвижения,
	|	ДенежныеСредстваНаЛицевыхСчетах.ВидСчета,
	|	ДенежныеСредстваНаЛицевыхСчетах.Сумма
	|ИЗ
	|	ВременнаяТаблицаДенежныеСредстваНаЛицевыхСчетах КАК ДенежныеСредстваНаЛицевыхСчетах
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДенежныеСредстваНаЛицевыхСчетах.НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДенежныеСредстваНаЛицевыхСчетах", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаВзаиморасчетыСКонтрагентами(СтруктураДополнительныеСвойства)
	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	|	ТаблицаВзаиморасчетыСКонтрагентами.НомерСтроки КАК НомерСтроки,
	|	ТаблицаВзаиморасчетыСКонтрагентами.ВидДвижения КАК ВидДвижения,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Период КАК Период,
	|	ТаблицаВзаиморасчетыСКонтрагентами.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Контрагент КАК Контрагент,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Организация КАК Организация,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Сумма КАК Сумма
	|ИЗ
	|	ВременнаяТаблицаВзаиморасчетыКонтрагентов КАК ТаблицаВзаиморасчетыСКонтрагентами
	|ГДЕ
	|	ТаблицаВзаиморасчетыСКонтрагентами.Сумма <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВзаиморасчетыСКонтрагентами", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры	

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаУправленческий(СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВременнаяТаблицаУправленческий.Период,
	|	ВременнаяТаблицаУправленческий.СтруктурнаяЕдиница,
	|	ВременнаяТаблицаУправленческий.СчетДт,
	|	ВременнаяТаблицаУправленческий.СчетКт,
	|	ВременнаяТаблицаУправленческий.СубконтоДт1,
	|	ВременнаяТаблицаУправленческий.СубконтоДт2,
	|	ВременнаяТаблицаУправленческий.СубконтоКт1,
	|	ВременнаяТаблицаУправленческий.СубконтоКт2,
	|	СУММА(ВременнаяТаблицаУправленческий.Сумма) КАК Сумма,
	|	ВременнаяТаблицаУправленческий.Содержание
	|ИЗ
	|	ВременнаяТаблицаУправленческий КАК ВременнаяТаблицаУправленческий
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаУправленческий.Период,
	|	ВременнаяТаблицаУправленческий.СтруктурнаяЕдиница,
	|	ВременнаяТаблицаУправленческий.СчетДт,
	|	ВременнаяТаблицаУправленческий.СчетКт,
	|	ВременнаяТаблицаУправленческий.СубконтоДт1,
	|	ВременнаяТаблицаУправленческий.СубконтоДт2,
	|	ВременнаяТаблицаУправленческий.СубконтоКт1,
	|	ВременнаяТаблицаУправленческий.СубконтоКт2,
	|	ВременнаяТаблицаУправленческий.Содержание";
	
	РезультатЗапроса = Запрос.Выполнить();	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Функция возвращает таблицу реквизитов, зависимых от хозяйственной операции документа.
//
Функция ПолучитьМассивСостоянияРеквизитов(ОбъектФормы) Экспорт
	
	МассивРеквизитов = Новый Массив;
	
	// Состояния реквизитов по умолчанию
	УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"ИсточникВидЛицевогоСчета",,Ложь);
    УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"ПриемникВидЛицевогоСчета",,Ложь);
	
	// Состояние реквизитов в зависимости типа ден. средств
	Если ОбъектФормы.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные Тогда
		
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"ИсточникСписанияСредств",,,,,"Касса",Новый ОписаниеТипов("СправочникСсылка.Кассы"));	
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"ПриемникЗачисленияСредств",,,,,"Касса",Новый ОписаниеТипов("СправочникСсылка.Кассы"));	
		
	ИначеЕсли ОбъектФормы.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные Тогда		 
		
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"ИсточникСписанияСредств",,,,,"Счет",Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета"));	
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"ПриемникЗачисленияСредств",,,,,"Счет",Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета"));	
		
	ИначеЕсли ОбъектФормы.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ЛицевойСчет Тогда
		
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"ИсточникСписанияСредств",,,,,"Пациент",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));	
		УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"ПриемникЗачисленияСредств",,,,,"Пациент",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));	

		Если Константы.ИспользоватьВидыЛицевыхСчетов.Получить() Тогда
			УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"ИсточникВидЛицевогоСчета",,Истина);
			УправлениеИнтерфейсамиСервер.ДобавитьЗначениеВМассивСостоянияРеквизитов(МассивРеквизитов,"ПриемникВидЛицевогоСчета",,Истина);		
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат МассивРеквизитов;
	
КонецФункции // ПолучитьМассивыРеквизитов()

// Получить массив обязательных для заполнения реквизитов реквизитов
Процедура ПолучитьМассивыОбязательныхРеквизитов(ДокументОбъект,МассивОбязательныхРеквизитов) Экспорт
	
	МассивОбязательныхРеквизитов.Добавить("ТипДенежныхСредств");
	МассивОбязательныхРеквизитов.Добавить("ИсточникСтруктурнаяЕдиница");
	МассивОбязательныхРеквизитов.Добавить("ПриемникСтруктурнаяЕдиница");
	МассивОбязательныхРеквизитов.Добавить("ИсточникСписанияСредств");
	МассивОбязательныхРеквизитов.Добавить("ПриемникЗачисленияСредств");
	МассивОбязательныхРеквизитов.Добавить("СуммаДокумента");

	// Состояние реквизитов в зависимости от типа денежных средств
	Если ДокументОбъект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Наличные Тогда
		
	ИначеЕсли ДокументОбъект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные Тогда		 
		
	ИначеЕсли ДокументОбъект.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.ЛицевойСчет Тогда	
		
		Если Константы.ИспользоватьВидыЛицевыхСчетов.Получить() Тогда
			МассивОбязательныхРеквизитов.Добавить("ИсточникВидЛицевогоСчета");
			МассивОбязательныхРеквизитов.Добавить("ПриемникВидЛицевогоСчета");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
